

const LearnComponent = () => {
    return (
        <div>
           Використовуйте псевдоклас :activeу своєму CSS . Потім елемент перейде в 
           :activeстан після клацання (припускаючи прив’язку). Хоча це не обов’язково 
           найкращий варіант, якщо вам потрібне широке охоплення веб-переглядача (тобто: 
           не підтримується старими браузерами), це єдиний варіант для реалізації чистого CSS.

            Використовуйте JavaScript . Використовуючи JavaScript, ви можете перемикати клас елемента 
            при клацанні, що дозволить вам змінити зовнішній вигляд елемента (включаючи будь-які переходи, 
            які ви встановили для нього). Щось на зразок: 
        </div>
    );
}

export default LearnComponent;